app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date DESC
---
  def index
    #debugger
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      #sort_var = params[:sort_var].to_i
      #@@sort_var = (@@sort_var - sort_var).abs
      #if @@sort_var == 0
        ordering, @title_header = {:order => 'title ASC'}, 'hilite'
      #else
      #  ordering, @title_header = {:order => 'title DESC'}, 'hilite'
      #end
    when 'release_date'
      #if @date_header == nil
        ordering, @date_header = {:order => 'release_date ASC'}, 'hilite'
      #else
      #  ordering, @date_header = {:order => 'release_date DESC'}, 'hilite'
      #end
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    #fills the ratings initially when webpage is loaded
    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]